org/blog/2021/design-my-own-logo.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 设计自己的标志

一个图形标志

- 确定字体

  - 选择现有
  - 自己设计

#+begin_quote

  1.  纯粹的文字看起来可能有些扁平，那就尝试给它一些厚度呈现立体效果

  2.  精简信息，使用首字母作为标志的主体

  3.  抽象一些也可以，不过无法清晰地看到首字母。「标志的寓意和精准传达信息是两码事」

  4.  立体效果+透视+强化空间感

  5.  抽象图形

  6.  先创作出外观满意的图形，然后对图形进行分析，解释它的寓意

  7.  提取文字的特征，进行抽象化

  8.  文字与行业的象征物结合

  9.  像素风

  10. 文字与图形融合

  11. 图形组成文字

  12. 已有的画面中剪掉图形

  13. 动态图标设计，纸媒中可以抽出关键帧表达动态
#+end_quote

--------------

#+begin_quote
  图形标志的第一步应该是满足氛围和感受，不要刻意为了追求寓意而去创作标志；

  不要把时间花费在纠结于优化某一款未确定的方案上，而是应该尽可能尝试更多的方案，这样才有可能遇到更合适的那一个；

  设计出一个让自己满意的标志外观固然很重要，但这仅仅是第一步，如何让人们认可它、记住它、唤醒它，才是一个标志真正的价值所在。
#+end_quote

--------------

*参考资料*：

1. [[https://www.bilibili.com/video/BV1aT4y1w7yL]]
