blog/2021/design-my-own-logo.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>设计自己的标志</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">设计自己的标志</h1>
</header><p>
一个图形标志
</p>

<ul class="org-ul">
<li>确定字体

<ul class="org-ul">
<li>选择现有</li>
<li>自己设计</li>
</ul></li>
</ul>

<blockquote>
<p>

</p>

<ol class="org-ol">
<li>纯粹的文字看起来可能有些扁平，那就尝试给它一些厚度呈现立体效果</li>

<li>精简信息，使用首字母作为标志的主体</li>

<li>抽象一些也可以，不过无法清晰地看到首字母。「标志的寓意和精准传达信息是两码事」</li>

<li>立体效果+透视+强化空间感</li>

<li>抽象图形</li>

<li>先创作出外观满意的图形，然后对图形进行分析，解释它的寓意</li>

<li>提取文字的特征，进行抽象化</li>

<li>文字与行业的象征物结合</li>

<li>像素风</li>

<li>文字与图形融合</li>

<li>图形组成文字</li>

<li>已有的画面中剪掉图形</li>

<li>动态图标设计，纸媒中可以抽出关键帧表达动态</li>
</ol>
</blockquote>

<hr>

<blockquote>
<p>
图形标志的第一步应该是满足氛围和感受，不要刻意为了追求寓意而去创作标志；
</p>

<p>
不要把时间花费在纠结于优化某一款未确定的方案上，而是应该尽可能尝试更多的方案，这样才有可能遇到更合适的那一个；
</p>

<p>
设计出一个让自己满意的标志外观固然很重要，但这仅仅是第一步，如何让人们认可它、记住它、唤醒它，才是一个标志真正的价值所在。
</p>
</blockquote>

<hr>

<p>
*参考资料*：
</p>

<ol class="org-ol">
<li><a href="https://www.bilibili.com/video/BV1aT4y1w7yL">https://www.bilibili.com/video/BV1aT4y1w7yL</a></li>
</ol>
</div>
</body>
</html>